In [1]:
import pandas as pd

In [2]:
df_employee = pd.read_csv('employee_data.csv')

In [3]:
df_employee.head()

  First Name Surname Department  Gender  Salary
0   Isabella  Garcia  Marketing  Female  108268
1      David  Garcia  Marketing    Male   83567
2   Isabella   Smith  Marketing  Female   82613
3       Jane   Jones         HR  Female   85891
4       Emma  Wilson    Finance  Female   61243

# Part 1

In [4]:
df_employee.describe()

              Salary
count     610.000000
mean    97475.655738
std     31871.677689
min     40469.000000
25%     68726.750000
50%     99666.500000
75%    124604.000000
max    149794.000000

In [5]:
df_employee['Full_Name'] = df_employee['First Name'] + " " + df_employee['Surname']

In [6]:
df_employee.head()

  First Name Surname Department  Gender  Salary        Full_Name
0   Isabella  Garcia  Marketing  Female  108268  Isabella Garcia
1      David  Garcia  Marketing    Male   83567     David Garcia
2   Isabella   Smith  Marketing  Female   82613   Isabella Smith
3       Jane   Jones         HR  Female   85891       Jane Jones
4       Emma  Wilson    Finance  Female   61243      Emma Wilson

In [7]:
# Check for duplicate rows

In [8]:
duplicate_name = df_employee[df_employee.duplicated()]

In [9]:
print(len(duplicate_name))

10

In [10]:
df_employee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 610 entries, 0 to 609
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  610 non-null    object
 1   Surname     610 non-null    object
 2   Department  610 non-null    object
 3   Gender      610 non-null    object
 4   Salary      610 non-null    int64
 5   Full_Name   610 non-null    object
dtypes: int64(1), object(5)
memory usage: 28.7+ KB

In [11]:
# drop duplicate rows

In [12]:
unique_employee = df_employee.drop_duplicates(inplace = True)

In [13]:
df_employee.info()

<class 'pandas.core.frame.DataFrame'>
Index: 600 entries, 0 to 599
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  600 non-null    object
 1   Surname     600 non-null    object
 2   Department  600 non-null    object
 3   Gender      600 non-null    object
 4   Salary      600 non-null    int64
 5   Full_Name   600 non-null    object
dtypes: int64(1), object(5)
memory usage: 32.8+ KB

In [14]:
num_employee = df_employee['Full_Name'].count()
print (f'{num_employee} employees')

600 employees

# 3. Maximum Salary

In [15]:
df_employee['Salary'].max()

149794

# 4. Gender distribution

In [16]:
gender_list = ['Male','Female']
for gend in gender_list:
    gender_count = df_employee[df_employee['Gender'] == gend]['Full_Name'].count()
    print(f"the total number of {gend}s is {gender_count}")
    gend=+1

the total number of Males is 293
the total number of Females is 307

# 5. Determine department with the highest average salary

In [17]:
# Provide the list of the departments

In [18]:
list_dept = df_employee['Department'].unique().tolist()

In [19]:
print(list_dept)

['Marketing', 'HR', 'Finance', 'Sales', 'Engineering']

In [20]:
Mean_Salary_List = []
i = 0
for dept in list_dept:
    mean_salary = df_employee[df_employee['Department'] == dept]['Salary'].mean()
    Mean_Salary_List.append(mean_salary)
    i += 1
else:
    print(Mean_Salary_List)

[99817.0948275862, 99133.09836065574, 95251.26618705037, 100416.0, 93146.66666666667]

In [21]:
# index_of_highest_value = values.index(max(values))
index_of_highest_value = Mean_Salary_List.index(max(Mean_Salary_List))
print(index_of_highest_value)

3

In [22]:
print(f'{list_dept[index_of_highest_value]} Department has the \nhighest average salary')

Sales Department has the
highest average salary

# 6. The total Salary expenditure for the company

In [23]:
total_salary_expenditure = df_employee['Salary'].sum()

In [24]:
print(total_salary_expenditure)

58542435

# 7. Employees in each Department

In [25]:
numb_per_dept_list = []
for dept in list_dept:
    count_per_dept = df_employee[df_employee['Department'] == dept]['Full_Name'].count()
    numb_per_dept_list.append(count_per_dept)
    print(numb_per_dept_list)

[116, 122, 139, 118, 105]

In [26]:
for dept in list_dept:
    count_per_dept = df_employee[df_employee['Department'] == dept]['Full_Name'].count()
    print(f"{dept} has {count_per_dept} employees")

Marketing has 116 employees
HR has 122 employees
Finance has 139 employees
Sales has 118 employees
Engineering has 105 employees

# 8. No age column so the age request is invalid

# 9. Average Salary per gender

In [27]:
list_gender = ['Male','Female']
for gend in list_gender:
    Average_Salary_per_gender = df_employee[df_employee['Gender'] == gend]['Salary'].mean()
    print(f"The average salary for {gend} gender is {Average_Salary_per_gender}")

The average salary for Male gender is 97389.4505119454
The average salary for Female gender is 97743.7328990228

# 10. No age column so the age request is invalid

# Part 2

In [28]:
df_employee['employee_bonus'] = df_employee['Salary']*0.1

In [29]:
df_employee.head()

,First Name,Surname,Department,Gender,Salary,Full_Name,employee_bonus
0,Isabella,Garcia,Marketing,Female,108268,Isabella Garcia,10826.8
1,David,Garcia,Marketing,Male,83567,David Garcia,8356.7
2,Isabella,Smith,Marketing,Female,82613,Isabella Smith,8261.3
3,Jane,Jones,HR,Female,85891,Jane Jones,8589.1
4,Emma,Wilson,Finance,Female,61243,Emma Wilson,6124.3

# 12. Total compensation column creation

In [30]:
df_employee['Total Compensation'] = df_employee['Salary'] * 1.1
df_employee.head()

,First Name,Surname,Department,Gender,Salary,Full_Name,employee_bonus,Total Compensation
0,Isabella,Garcia,Marketing,Female,108268,Isabella Garcia,10826.8,119094.8
1,David,Garcia,Marketing,Male,83567,David Garcia,8356.7,91923.7
2,Isabella,Smith,Marketing,Female,82613,Isabella Smith,8261.3,90874.3
3,Jane,Jones,HR,Female,85891,Jane Jones,8589.1,94480.1
4,Emma,Wilson,Finance,Female,61243,Emma Wilson,6124.3,67367.3

In [31]:
# Reorder the columns
df_employee = df_employee[['First Name', 'Surname', 'Full_Name', 
                           'Department', 'Gender', 'Salary', 'employee_bonus', 'Total Compensation']]

# Print the reordered DataFrame
print(df_employee)
df_employee.head()

    First Name   Surname         Full_Name   Department  Gender  Salary
0     Isabella    Garcia   Isabella Garcia    Marketing  Female  108268  \
1        David    Garcia      David Garcia    Marketing    Male   83567
2     Isabella     Smith    Isabella Smith    Marketing  Female   82613
3         Jane     Jones        Jane Jones           HR  Female   85891
4         Emma    Wilson       Emma Wilson      Finance  Female   61243
..         ...       ...               ...          ...     ...     ...
595    Matthew     Brown     Matthew Brown    Marketing    Male   77292
596    Michael  Williams  Michael Williams  Engineering    Male  139131
597       Jane     Smith        Jane Smith  Engineering  Female  115577
598       John     Brown        John Brown    Marketing    Male   95986
599    Matthew  Williams  Matthew Williams    Marketing    Male   50413

     employee_bonus  Total Compensation
0           10826.8            119094.8
1            8356.7             91923.7
2            8261.3             90874.3
3            8589.1             94480.1
4            6124.3             67367.3
..              ...                 ...
595          7729.2             85021.2
596         13913.1            153044.1
597         11557.7            127134.7
598          9598.6            105584.6
599          5041.3             55454.3

[600 rows x 8 columns]

,First Name,Surname,Full_Name,Department,Gender,Salary,employee_bonus,Total Compensation
0,Isabella,Garcia,Isabella Garcia,Marketing,Female,108268,10826.8,119094.8
1,David,Garcia,David Garcia,Marketing,Male,83567,8356.7,91923.7
2,Isabella,Smith,Isabella Smith,Marketing,Female,82613,8261.3,90874.3
3,Jane,Jones,Jane Jones,HR,Female,85891,8589.1,94480.1
4,Emma,Wilson,Emma Wilson,Finance,Female,61243,6124.3,67367.3

# 13. Create new file new_employee_data.csv

In [32]:
# Write the data to a new file
df_employee.to_csv("new_employee_data.csv", index=False)